from yasbd.rules.ru import Rules, RuRules


# fmt: off
class BgRules(RuRules):


    TITLE_ABBRVS = RuRules.TITLE_ABBRVS | {
        # Professional titles
        "ас", "инж", "арх", "адв", "докт", "м.а", "н.с",
        "ст. н. с", "зам.-дир", "д-р",

        # Military ranks
        "подполк", "май", "о.з", "о.р", "в.о", "и.д",

        # Social
        "г-ца", "др",
    }

    DOTTED_GEOPOL_ABBRVS = RuRules.DOTTED_GEOPOL_ABBRVS | {
        "Р.Б", "Р.С.М", "С.А.Щ",
    }

    REFERENCE_ABBRVS = RuRules.REFERENCE_ABBRVS | {
        "бр", "бел", "и др", "и под", "ал", "изд", "фиг",
        "табл", "чл",
    }

    SECTION_MARKERS = RuRules.SECTION_MARKERS | {
        "Част", "Член", "Статия", "Модул",
        "Използване", "Предговор", "Въведение",
    }

    INLINE_ONLY_ABBRVS = Rules.INLINE_ONLY_ABBRVS | {
        "вж", "срв", "вкл", "ул", "бул", "пл", "кв",
        "бл", "вх", "ет", "ап", "ж.к", "п.к", "общ", "обл",
    }

    DATE_ABBRVS = RuRules.DATE_ABBRVS | {
        # Months
        "яну", "фев", "мар", "апр", "май", "юни", "юли",
        "авг", "сеп", "окт", "ное", "дек",

        # Days
        "пон", "вто", "сря", "чет", "пет", "съб", "нед",
    }

    COMMON_SENT_STARTERS =  {
        # Pronouns
        "Аз", "Ти", "Той", "Тя", "То", "Ние", "Вие", "Те",
        "Това", "Тези", "Тази", "Този",

        # Question words
        "Какво", "Кой", "Коя", "Кое", "Кои", "Кога",
        "Къде", "Защо", "Как", "Чий", "Чия", "Чие", "Чии",

        # Conjunctions & transitions
        "Но", "Обаче", "Въпреки", "Затова", "Освен",
        "Първо", "Второ", "Накрая", "Следователно",
        "Понеже", "Между", "Още", "Вече", "Сега",
        "Преди", "След", "Тогава", "Ето", "Наистина",
        "Или", "Все", "Никой", "Нищо", "Всички",
        "Може", "Трябва", "Няма",
    }

# fmt: on
